ryan99alero/Attendance/storage/app/templates/esp32_p4_nfc_espidf/main/main.c
/**
 * ESP32-P4 NFC Time Clock - NFC Card Reader with Display and API Integration
 */

// Feature configuration (MUST BE BEFORE OTHER INCLUDES)
#include "features.h"

#include <stdio.h>
#include <string.h>
#include <time.h>
#include <sys/time.h>
#include "driver/gpio.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_log.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "esp_sntp.h"
#include "nvs_flash.h"
#include "firmware_info.h"
#include "time_settings.h"

// Board Support Package for ESP32-P4-Function-EV-Board
#include "bsp/esp32_p4_function_ev_board.h"
#include "esp_lvgl_port.h"
#include "lvgl.h"

// UI Manager
#if DISPLAY_ENABLED
#include "ui_manager.h"
#include "ui.h"  // SquareLine Studio UI
#include "ui_bridge.h"  // Bridge between SquareLine UI and backend
#include "ui_events.h"  // Event handlers with punch display helpers
#endif

// NFC driver - PN532 abstraction layer
#if NFC_ENABLED
#include "nfc_reader.h"
#endif

// Network manager (abstracts WiFi, Ethernet, Bluetooth)
#if WIFI_ENABLED || ETHERNET_ENABLED
#include "network_manager.h"
#endif

#if API_ENABLED
#include "api_client.h"
#include "punch_queue.h"
#include "esp_mac.h"
#endif

// WiFi Configuration (TODO: Make configurable via NVS or web interface)
#if WIFI_ENABLED
#define WIFI_SSID      "YOUR_WIFI_SSID"      // Change this
#define WIFI_PASSWORD  "YOUR_WIFI_PASSWORD"  // Change this
#endif

// API Configuration (TODO: Make configurable)
#if API_ENABLED
#define API_SERVER_HOST "192.168.29.25"  // Herd local server
#define API_SERVER_PORT 8000             // HTTP port
#define API_DEVICE_NAME "ESP32-P4-NFC-Clock-01"
#endif

// Pin definitions for PN532 NFC Module V3 (SPI mode)
#define NFC_SCK_PIN  GPIO_NUM_20
#define NFC_MISO_PIN GPIO_NUM_21
#define NFC_MOSI_PIN GPIO_NUM_22
#define NFC_CS_PIN   GPIO_NUM_23
#define NFC_RST_PIN  GPIO_NUM_32
#define NFC_IRQ_PIN  -1  // Not using IRQ

#define NFC_SPI_HOST SPI3_HOST  // Changed from SPI2_HOST to avoid conflict with WiFi transport

static const char *TAG = "NFC_TIMECLOCK";

// NFC global variables
#if NFC_ENABLED
static nfc_reader_handle_t nfc_reader = NULL;
static uint32_t card_count = 0;
static char last_card_uid[32] = {0};
static uint64_t last_card_time = 0;
#endif

// Display variables - removed (using UI manager)

#if DISPLAY_ENABLED
// Password validation callback for admin access
static void validate_admin_password(const char *password, bool *is_valid) {
	if (strcmp(password, DEFAULT_ADMIN_PASSWORD) == 0) {
		*is_valid = true;
		ESP_LOGI(TAG, "Admin password accepted");
	} else {
		*is_valid = false;
		ESP_LOGW(TAG, "Invalid admin password attempt");
	}
}

#endif

#if API_ENABLED
// Connectivity monitor task - checks server health every 30 seconds
// Gets device status (approved/pending/suspended) and handles reboot commands
static void connectivity_monitor_task(void *pvParameters) {
	const TickType_t check_interval = pdMS_TO_TICKS(30000);  // 30 seconds
	const int failure_threshold = 3;  // Show alert after 3 consecutive failures
	int consecutive_failures = 0;

	// Initial delay to let network stabilize
	vTaskDelay(pdMS_TO_TICKS(15000));  // 15 sec after boot

	while (1) {
		// Only check if network is connected
		if (network_manager_is_connected()) {
			api_config_t *cfg = api_get_config();
			health_check_result_t health_result = {0};

			esp_err_t ret = api_health_check_full(&health_result);

			if (ret == ESP_OK && health_result.server_reachable) {
				// Server is reachable
				if (consecutive_failures > 0) {
					ESP_LOGI(TAG, "Server back online after %d failures", consecutive_failures);
				}
				consecutive_failures = 0;

				// Only clear server offline status, preserve authorization status
				clock_status_t current_status = ui_get_clock_status();
				if (current_status == CLOCK_STATUS_SERVER_OFFLINE) {
					// Server is back - now check device status
					if (health_result.device_found) {
						if (health_result.is_approved) {
							ui_set_clock_status(CLOCK_STATUS_OK, NULL);
						} else {
							// Not approved - show appropriate status
							if (strcmp(health_result.registration_status, "suspended") == 0) {
								ui_set_clock_status(CLOCK_STATUS_SUSPENDED, cfg->device_name);
							} else {
								ui_set_clock_status(CLOCK_STATUS_NOT_AUTHORIZED, cfg->device_name);
							}
						}
					} else {
						// Device not found on server
						api_clear_registration();
						ui_set_clock_status(CLOCK_STATUS_NOT_REGISTERED, NULL);
					}
				}

				// If device is registered, check authorization status from health response
				if (cfg->is_registered && health_result.device_found) {
					// Update UI based on current authorization status
					if (health_result.is_approved) {
						// Device is approved - clear any non-OK status
						if (current_status != CLOCK_STATUS_OK) {
							ui_set_clock_status(CLOCK_STATUS_OK, NULL);
							ESP_LOGI(TAG, "Device approved - status cleared");
						}
					} else {
						// Device not approved - show status
						if (strcmp(health_result.registration_status, "suspended") == 0) {
							if (current_status != CLOCK_STATUS_SUSPENDED) {
								ui_set_clock_status(CLOCK_STATUS_SUSPENDED, cfg->device_name);
								ESP_LOGW(TAG, "Device suspended - showing status");
							}
						} else if (strcmp(health_result.registration_status, "rejected") == 0) {
							if (current_status != CLOCK_STATUS_NOT_AUTHORIZED) {
								ui_set_clock_status(CLOCK_STATUS_NOT_AUTHORIZED, cfg->device_name);
								ESP_LOGW(TAG, "Device rejected - showing status");
							}
						} else {
							// pending or other
							if (current_status != CLOCK_STATUS_NOT_AUTHORIZED) {
								ui_set_clock_status(CLOCK_STATUS_NOT_AUTHORIZED, cfg->device_name);
								ESP_LOGW(TAG, "Device pending approval - showing status");
							}
						}
					}

					// Handle reboot command from server
					if (health_result.reboot_requested) {
						ESP_LOGW(TAG, "🔄 Reboot requested by server - rebooting in 3 seconds...");
						vTaskDelay(pdMS_TO_TICKS(3000));
						esp_restart();
					}

					// Handle token expiration - auto re-authenticate
					if (health_result.needs_reauth && strlen(cfg->mac_address) > 0) {
						ESP_LOGW(TAG, "🔑 Token expired - auto re-authenticating...");
						esp_err_t reauth_result = api_register_device(cfg->mac_address, cfg->device_name);
						if (reauth_result == ESP_OK) {
							ESP_LOGI(TAG, "✅ Re-authentication successful");
							api_save_config();
						} else {
							ESP_LOGE(TAG, "❌ Re-authentication failed: %s", esp_err_to_name(reauth_result));
						}
					}

					// Update machine name label if display_name changed
					if (strlen(health_result.display_name) > 0) {
						api_save_config();  // Save updated display_name to NVS
						// Update the machine name label on UI
						if (ui_mainscreen_label_machinenamelabel) {
							const char *name = (cfg->display_name[0] != '\0') ? cfg->display_name : cfg->device_name;
							lv_label_set_text(ui_mainscreen_label_machinenamelabel, name);
							ESP_LOGI(TAG, "Updated machine name label: %s", name);
						}
					}
				} else if (cfg->is_registered && !health_result.device_found) {
					// Device was deleted from server
					ESP_LOGW(TAG, "Device deleted from server - clearing registration");
					api_clear_registration();
					ui_set_clock_status(CLOCK_STATUS_NOT_REGISTERED, NULL);
				}
			} else if (ret == ESP_ERR_NOT_FOUND) {
				// Device not found on server
				consecutive_failures = 0;  // Server is reachable
				ESP_LOGW(TAG, "Device not found on server - clearing registration");
				api_clear_registration();
				ui_set_clock_status(CLOCK_STATUS_NOT_REGISTERED, NULL);
			} else {
				// Health check failed - server unreachable
				consecutive_failures++;
				ESP_LOGW(TAG, "Health check failed (%d/%d)", consecutive_failures, failure_threshold);

				if (consecutive_failures >= failure_threshold) {
					ui_set_clock_status(CLOCK_STATUS_SERVER_OFFLINE, NULL);
				}
			}
		} else {
			// Network not connected
			consecutive_failures++;
			if (consecutive_failures >= failure_threshold) {
				ui_set_clock_status(CLOCK_STATUS_SERVER_OFFLINE, NULL);
			}
		}

