ryan99alero/Attendance/storage/app/templates/esp32_p4_nfc_espidf/main/main.c
		vTaskDelay(check_interval);
	}
}

// Daily sync task - syncs time, timezone, and sends heartbeat every 24 hours
// Also runs 30 seconds after boot to sync settings from server
static void daily_sync_task(void *pvParameters) {
	const TickType_t initial_delay = pdMS_TO_TICKS(30000);  // 30 sec after boot
	const TickType_t sync_interval = pdMS_TO_TICKS(24 * 60 * 60 * 1000);  // 24 hours

	// Initial delay to let network stabilize
	vTaskDelay(initial_delay);

	while (1) {
		ESP_LOGI(TAG, "Daily sync starting...");

		// Only sync if network is connected and device is registered
		if (network_manager_is_connected()) {
			api_config_t *config = api_get_config();

			// Sync time and timezone from server
			time_sync_data_t sync_data;
			esp_err_t ret = api_sync_time(&sync_data);
			if (ret == ESP_OK && sync_data.valid) {
				// Apply timezone FIRST (before setting time)
				if (strlen(sync_data.timezone) > 0) {
					bool tz_applied = time_settings_apply_by_name(sync_data.timezone);
					if (tz_applied) {
						ESP_LOGI(TAG, "Timezone applied from server: %s", sync_data.timezone);
					} else {
						// Fallback to offset-based timezone
						char tz_str[64];
						if (time_settings_get_posix_for_offset(sync_data.timezone_offset, tz_str, sizeof(tz_str))) {
							setenv("TZ", tz_str, 1);
							tzset();
							ESP_LOGI(TAG, "Timezone set from offset: %s", tz_str);
						}
					}
				}

				// Set system time from unix timestamp
				if (sync_data.unix_timestamp > 0) {
					struct timeval tv;
					tv.tv_sec = (time_t)sync_data.unix_timestamp;
					tv.tv_usec = 0;
					settimeofday(&tv, NULL);
					ESP_LOGI(TAG, "System time synced: %lld", (long long)sync_data.unix_timestamp);
				}

				// Update display with new time
				time_t now;
				struct tm timeinfo;
				time(&now);
				localtime_r(&now, &timeinfo);

				if (lvgl_port_lock(100)) {
					// Update main screen time display
					if (ui_mainscreen_label_timelabel) {
						char time_str[16];
						strftime(time_str, sizeof(time_str), "%I:%M %p", &timeinfo);
						lv_label_set_text(ui_mainscreen_label_timelabel, time_str);
					}
					if (ui_mainscreen_label_datelabel) {
						char date_str[16];
						strftime(date_str, sizeof(date_str), "%m/%d/%Y", &timeinfo);
						lv_label_set_text(ui_mainscreen_label_datelabel, date_str);
					}
					lvgl_port_unlock();
				}

				ESP_LOGI(TAG, "Time and timezone synced from server");
			}

			// Send heartbeat with IP address if registered
			if (config->is_registered) {
				char ip_str[16] = {0};
				network_manager_get_ip_string(ip_str, sizeof(ip_str));
				ret = api_send_heartbeat(ip_str);
				if (ret == ESP_OK) {
					ESP_LOGI(TAG, "Heartbeat sent with IP: %s", ip_str);
				}
			}
		}

		ESP_LOGI(TAG, "Daily sync complete, next sync in 24 hours");
		vTaskDelay(sync_interval);
	}
}
#endif

void app_main(void) {
	ESP_EARLY_LOGI("MAIN", ">>> app_main ENTERED <<<");
	ESP_EARLY_LOGI("MAIN", "About to print banner...");
	printf("\n\n=== ESP32-P4 NFC TIME CLOCK ===\n");
	ESP_EARLY_LOGI("MAIN", "Banner printed, about to print version...");
	printf("Firmware Version: %s\n", FIRMWARE_VERSION);
	printf("Build Date: %s\n", FIRMWARE_BUILD_DATE);
	printf("Build Time: %s\n\n", FIRMWARE_BUILD_TIME);
	ESP_EARLY_LOGI("MAIN", "Version info printed, initializing NVS...");

	// Initialize NVS (required for WiFi)
	esp_err_t ret = nvs_flash_init();
	ESP_EARLY_LOGI("MAIN", "NVS init returned: %d", ret);
	if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
		ESP_ERROR_CHECK(nvs_flash_erase());
		ret = nvs_flash_init();
	}
	ESP_ERROR_CHECK(ret);
	printf("NVS initialized\n\n");

	// Restore time settings (timezone, NTP server) from NVS
	// This must be called AFTER nvs_flash_init()
	time_settings_init_nvs();
	printf("Time settings restored from NVS\n");
	printf("   Timezone: %s\n", getenv("TZ") ? getenv("TZ") : "(default)");
	printf("   NTP Server: %s\n\n", time_settings_get_ntp_server());

#if DISPLAY_ENABLED
	// Initialize display FIRST to claim frame buffer memory before WiFi/NFC
	ESP_EARLY_LOGI("MAIN", "About to call bsp_display_start()...");
	bsp_display_start();
	ESP_EARLY_LOGI("MAIN", "bsp_display_start() returned");

	ESP_EARLY_LOGI("MAIN", "About to call bsp_display_backlight_on()...");
	bsp_display_backlight_on();
	ESP_EARLY_LOGI("MAIN", "bsp_display_backlight_on() returned");

	// Initialize SquareLine Studio UI
	ESP_EARLY_LOGI("MAIN", "About to call lvgl_port_lock()...");
	lvgl_port_lock(0);
	ESP_EARLY_LOGI("MAIN", "lvgl_port_lock() returned, calling ui_init()...");
	ui_init();  // Create all SquareLine screens
	ESP_EARLY_LOGI("MAIN", "ui_init() returned, calling ui_bridge_init()...");
	ui_bridge_init();  // Connect SquareLine UI to backend managers
	ESP_EARLY_LOGI("MAIN", "ui_bridge_init() returned, calling lvgl_port_unlock()...");
	lvgl_port_unlock();
	ESP_EARLY_LOGI("MAIN", "Display init complete");

	printf("Display initialized with SquareLine UI and backend bridge!\n");
	printf("Free heap after display: %lu bytes\n\n", (unsigned long)esp_get_free_heap_size());
#else
	ESP_EARLY_LOGI("MAIN", "Display disabled");
#endif

#if WIFI_ENABLED || ETHERNET_ENABLED
	// Initialize network manager (handles WiFi, Ethernet, Bluetooth)
	ESP_EARLY_LOGI("MAIN", "About to init network manager...");
	if (network_manager_init() == ESP_OK) {
		ESP_EARLY_LOGI("MAIN", "Network manager init OK");
		printf("✅ Network manager initialized\n");
		printf("   Configure networks through Setup menu\n\n");

		// Try to load and connect to saved configurations
		ESP_EARLY_LOGI("MAIN", "About to call load_and_connect...");
		network_manager_load_and_connect();
		ESP_EARLY_LOGI("MAIN", "load_and_connect returned");

		// Initialize SNTP with saved NTP server once network is connected
		if (network_manager_is_connected()) {
			const char *ntp_server = time_settings_get_ntp_server();
			ESP_LOGI(TAG, "Starting SNTP with server: %s", ntp_server);

			// Stop any existing SNTP
			if (esp_sntp_enabled()) {
				esp_sntp_stop();
			}

			// Configure and start SNTP
			esp_sntp_setoperatingmode(SNTP_OPMODE_POLL);
			esp_sntp_setservername(0, ntp_server);
			esp_sntp_init();

			printf("✅ SNTP initialized with server: %s\n", ntp_server);
		}

#if DISPLAY_ENABLED
		// Start network monitoring task
		printf("Starting network monitoring...\n");
		network_manager_start_monitoring();
		printf("✅ Network monitoring started\n\n");
#endif
	} else {
		printf("❌ Failed to initialize network manager\n\n");
	}
#else
	printf("All networks disabled (enable via WIFI_ENABLED or ETHERNET_ENABLED in main.c)\n\n");
#endif

#if API_ENABLED
	// Initialize API client
	if (network_manager_is_connected()) {
		printf("Initializing API client...\n");

		// Get MAC address for device registration
		uint8_t mac[6];
		esp_read_mac(mac, ESP_MAC_WIFI_STA);
		char mac_str[18];
		snprintf(mac_str, sizeof(mac_str), "%02X:%02X:%02X:%02X:%02X:%02X",
		         mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

		// Configure API client
		api_config_t api_config = {
			.server_host = API_SERVER_HOST,
			.server_port = API_SERVER_PORT,
			.mac_address = "",  // Will be populated below
			.is_registered = false,
			.is_approved = false
		};
		strcpy(api_config.device_name, API_DEVICE_NAME);
		strncpy(api_config.mac_address, mac_str, sizeof(api_config.mac_address) - 1);

		api_client_init(&api_config);

		// Load saved registration state from NVS (persists across reboots)
		if (api_load_config() == ESP_OK) {
			api_config_t *saved_config = api_get_config();
			if (saved_config->is_registered) {
				printf("✅ Restored registration from NVS\n");
				printf("   Device ID: %s\n", saved_config->device_id);
				printf("   Server: %s:%d\n\n", saved_config->server_host, saved_config->server_port);
			}

			// Ensure MAC address is populated (for devices registered before this update)
			if (strlen(saved_config->mac_address) == 0) {
				strncpy(saved_config->mac_address, mac_str, sizeof(saved_config->mac_address) - 1);
				printf("   MAC address populated: %s\n", mac_str);
				api_save_config();
			}
		}

		// Test server health (but don't auto-register - let user register via ServerSetup)
		if (api_health_check() == ESP_OK) {
			printf("✅ Server is reachable\n");
			api_config_t *cfg = api_get_config();
			if (cfg->is_registered) {
				// Verify registration is still valid on server
				printf("Verifying registration with server...\n");
				esp_err_t verify_result = api_verify_registration();

				if (verify_result == ESP_OK) {
					printf("✅ Registration verified - device exists on server\n");
					if (cfg->is_approved) {
						printf("✅ Device is approved\n\n");
						// Clear any previous status (device is good)
						ui_set_clock_status(CLOCK_STATUS_OK, NULL);
					} else {
						printf("⚠️  Device pending approval\n\n");
						// Show not authorized status on display
						ui_set_clock_status(CLOCK_STATUS_NOT_AUTHORIZED, cfg->device_name);
					}
				} else if (verify_result == ESP_ERR_NOT_FOUND) {
					printf("❌ Device was deleted from server - registration cleared\n");
					printf("   Use ServerSetup screen to re-register\n\n");
					// Show not registered status on display
					ui_set_clock_status(CLOCK_STATUS_NOT_REGISTERED, NULL);
				} else {
					// Other error but server was reachable - keep cached
					printf("⚠️  Could not verify registration - using cached state\n\n");
				}
			} else {
				printf("Use ServerSetup screen to register device\n\n");
				// Device not registered - show status
				ui_set_clock_status(CLOCK_STATUS_NOT_REGISTERED, NULL);
			}
		} else {
			printf("❌ Cannot reach server at %s:%d\n", API_SERVER_HOST, API_SERVER_PORT);
			api_config_t *cfg = api_get_config();
			if (cfg->is_registered) {
				printf("   Using cached registration (offline mode)\n\n");
				// Server offline but we have cached registration
				ui_set_clock_status(CLOCK_STATUS_SERVER_OFFLINE, NULL);
			} else {
				printf("   Device not registered\n\n");
				// Not registered and can't reach server
				ui_set_clock_status(CLOCK_STATUS_NOT_REGISTERED, NULL);
			}
		}
	}

	// Start daily sync task (time sync + heartbeat every 24h, first sync 30s after boot)
	xTaskCreate(daily_sync_task, "daily_sync", 8192, NULL, 3, NULL);
	printf("✅ Daily sync task started (first sync in 30s)\n");

	// Start connectivity monitor task (health check every 30s, alert after 3 failures)
	xTaskCreate(connectivity_monitor_task, "conn_monitor", 4096, NULL, 3, NULL);
	printf("✅ Connectivity monitor started (checks every 30s)\n\n");

	// Initialize punch queue for offline buffering
	if (punch_queue_init() == ESP_OK) {
		printf("✅ Punch queue initialized\n");
		uint32_t pending = punch_queue_pending_count();
		if (pending > 0) {
			printf("   ⚠️  %lu punches pending sync\n", (unsigned long)pending);
		}
		// Start background sync task (every 30 seconds)
		punch_queue_start_sync_task(30000);
		printf("✅ Punch sync task started\n\n");
	} else {
		printf("❌ Failed to initialize punch queue\n\n");
	}
#else
	printf("API disabled\n\n");
#endif

