ryan99alero/Attendance/storage/app/templates/esp32_p4_nfc_espidf/main/main.c
#if NFC_ENABLED
	printf("Initializing PN532 NFC Module V3...\n");
	printf("DIP Switches: SEL0=1, SEL1=0 (SPI mode)\n\n");

	// Configure PN532
	nfc_reader_config_t nfc_config = {
		.type = NFC_READER_PN532,
		.spi_host = NFC_SPI_HOST,
		.miso_pin = NFC_MISO_PIN,
		.mosi_pin = NFC_MOSI_PIN,
		.sck_pin = NFC_SCK_PIN,
		.cs_pin = NFC_CS_PIN,
		.rst_pin = NFC_RST_PIN,
		.irq_pin = NFC_IRQ_PIN,
		.spi_speed_hz = 5000000,  // 5 MHz
	};

	// Initialize PN532
	ret = nfc_reader_init(&nfc_config, &nfc_reader);
	if (ret != ESP_OK) {
		printf("❌ PN532 initialization FAILED: %s\n", esp_err_to_name(ret));
		printf("\nCheck wiring:\n");
		printf("  VCC  → 3.3V\n");
		printf("  GND  → GND\n");
		printf("  MOSI → GPIO%d\n", NFC_MOSI_PIN);
		printf("  MISO → GPIO%d\n", NFC_MISO_PIN);
		printf("  SCK  → GPIO%d\n", NFC_SCK_PIN);
		printf("  SS   → GPIO%d\n", NFC_CS_PIN);
		printf("  RST  → GPIO%d\n", NFC_RST_PIN);
		printf("  DIP: SEL0=1, SEL1=0\n");

		// Continue with heartbeat even if NFC fails
		printf("\nContinuing with heartbeat only...\n\n");
		int counter = 0;
		while (1) {
			printf("Heartbeat %d (NFC disabled)\n", counter++);
			vTaskDelay(pdMS_TO_TICKS(2000));
		}
	}

	// Get firmware version
	uint32_t version;
	if (nfc_reader_get_firmware_version(nfc_reader, &version) == ESP_OK) {
		printf("✅ PN532 initialized successfully!\n");
		printf("   Firmware: PN5%02lX v%ld.%ld\n\n",
		       (unsigned long)((version >> 24) & 0xFF),
		       (unsigned long)((version >> 16) & 0xFF),
		       (unsigned long)((version >> 8) & 0xFF));
	}

	printf("Ready to read cards. Place a card near the reader...\n\n");

#if DISPLAY_ENABLED
	// TODO: Update UI - NFC is ready (Phase 6)
	// lvgl_port_lock(0);
	// ui_update_status(NET_STATUS_DISCONNECTED, NFC_STATUS_READY);
	// ui_show_ready_screen("Ready to scan cards");
	// lvgl_port_unlock();
#endif
#else
	printf("NFC disabled for display testing\n\n");
#endif

#if NFC_ENABLED
	// Main loop - scan for cards
	nfc_card_uid_t uid;
	char uid_str[32];
	int heartbeat_counter = 0;

	while (1) {
		// Try to read card
		ret = nfc_reader_read_card_uid(nfc_reader, &uid);

		if (ret == ESP_OK) {
			// Convert UID to string
			nfc_reader_uid_to_string(&uid, uid_str, sizeof(uid_str));

			// Get current time
			uint64_t current_time = esp_timer_get_time() / 1000;

			// Debounce - ignore same card within 2 seconds
			if (strcmp(uid_str, last_card_uid) != 0 ||
			    (current_time - last_card_time) > 2000) {

				// Update last card info
				strncpy(last_card_uid, uid_str, sizeof(last_card_uid) - 1);
				last_card_time = current_time;
				card_count++;

				// Get card type
				nfc_card_type_t card_type = nfc_reader_get_card_type(&uid);
				const char *type_name = nfc_reader_get_card_type_name(card_type);

				// Print card info to console
				printf("\n🎫 === CARD DETECTED #%lu ===\n", (unsigned long)card_count);
				printf("   UID:  %s\n", uid_str);
				printf("   Type: %s\n", type_name);
				printf("   SAK:  0x%02X\n", uid.sak);
				printf("   Size: %d bytes\n", uid.size);
				printf("   Time: %llu ms\n\n", current_time);

				// Generate timestamp from device clock (shared by API and Display)
				time_t now = time(NULL);
				struct tm timeinfo;
				localtime_r(&now, &timeinfo);

#if API_ENABLED
				// Queue punch for sync (offline-first approach)
				api_config_t *api_config = api_get_config();

				// Format event time for API (ISO 8601)
				char event_time[32];
				strftime(event_time, sizeof(event_time), "%Y-%m-%dT%H:%M:%S", &timeinfo);

				// Always queue the punch first (survives network issues/reboots)
				esp_err_t queue_result = punch_queue_add(
					uid_str,                              // credential_value (card UID)
					type_name,                            // credential_kind (card type)
					event_time,                           // event_time (device local time)
					api_config->device_id,                // device_id
					-6                                    // timezone_offset (CST) TODO: Make configurable
				);

				if (queue_result == ESP_OK) {
					printf("✅ Punch queued (time: %s)\n", event_time);

					// Trigger immediate sync attempt if registered
					if (api_config->is_registered) {
						punch_queue_trigger_sync();
					} else {
						printf("⚠️  Device not registered - punch saved for later sync\n");
					}
				} else if (queue_result == ESP_ERR_NO_MEM) {
					printf("❌ Punch queue full! Cannot record punch\n");
				} else {
					printf("❌ Failed to queue punch: %s\n", esp_err_to_name(queue_result));
				}

				// Show queue status
				uint32_t pending = punch_queue_pending_count();
				if (pending > 1) {
					printf("   📋 %lu punches pending sync\n", (unsigned long)pending);
				}
				printf("\n");
#endif

#if DISPLAY_ENABLED
				// Update display with new UI manager
				card_scan_result_t scan_result = {0};
				strncpy(scan_result.card_uid, uid_str, sizeof(scan_result.card_uid) - 1);
				strncpy(scan_result.card_type, type_name, sizeof(scan_result.card_type) - 1);

				// Initialize default values
				strncpy(scan_result.employee.name, "Unknown Employee", sizeof(scan_result.employee.name) - 1);
				strncpy(scan_result.employee.employee_id, "---", sizeof(scan_result.employee.employee_id) - 1);
				strncpy(scan_result.employee.department, "Not Enrolled", sizeof(scan_result.employee.department) - 1);
				scan_result.employee.is_authorized = false;
				scan_result.employee.today_hours = 0.0f;
				scan_result.employee.week_hours = 0.0f;
				scan_result.employee.pay_period_hours = 0.0f;
				scan_result.employee.vacation_balance = 0.0f;

#if API_ENABLED
				// Fetch employee info and hours from API
				api_config_t *api_cfg = api_get_config();
				if (api_cfg->is_registered) {
					employee_info_t emp_info = {0};
					esp_err_t emp_result = api_get_employee_info(uid_str, &emp_info);
					if (emp_result == ESP_OK) {
						// Copy employee info to scan result
						strncpy(scan_result.employee.name, emp_info.name, sizeof(scan_result.employee.name) - 1);
						strncpy(scan_result.employee.employee_id, emp_info.employee_id, sizeof(scan_result.employee.employee_id) - 1);
						strncpy(scan_result.employee.department, emp_info.department, sizeof(scan_result.employee.department) - 1);
						scan_result.employee.is_authorized = emp_info.is_authorized;
						scan_result.employee.today_hours = emp_info.today_hours;
						scan_result.employee.week_hours = emp_info.week_hours;
						scan_result.employee.pay_period_hours = emp_info.pay_period_hours;
						scan_result.employee.vacation_balance = emp_info.vacation_balance;
						printf("✅ Employee info retrieved from API\n\n");

