ryan99alero/Attendance/storage/app/templates/esp32_p4_nfc_espidf/main/main.c
						// Server is reachable
						punch_queue_set_server_status(true);
					} else if (emp_result == ESP_ERR_NOT_FOUND) {
						printf("⚠️  Employee not found in system\n\n");
						// Server is reachable, just no employee record
						punch_queue_set_server_status(true);
					} else if (emp_result == ESP_ERR_TIMEOUT) {
						printf("❌ Server unreachable - punch queued for later sync\n\n");
						// Server is unreachable
						punch_queue_set_server_status(false);
					} else {
						printf("⚠️  Failed to fetch employee info (error: %s)\n\n", esp_err_to_name(emp_result));
						// Other error - assume server issue
						punch_queue_set_server_status(false);
					}
				}
#endif

				// Format timestamp for display
				strftime(scan_result.timestamp, sizeof(scan_result.timestamp),
				         "%Y-%m-%d %H:%M:%S", &timeinfo);

				scan_result.success = true;
				snprintf(scan_result.message, sizeof(scan_result.message),
				         "Card #%lu scanned", (unsigned long)card_count);

				// Show punch info on MainScreen UI
				ui_show_employee_info(scan_result.employee.name);

				// Format date and time for punch display
				char punch_date[16];
				char punch_time[16];
				strftime(punch_date, sizeof(punch_date), "%m/%d/%Y", &timeinfo);
				strftime(punch_time, sizeof(punch_time), "%I:%M %p", &timeinfo);
				ui_show_punch_info(punch_date, punch_time);
#endif
			}

			// Halt the card
			nfc_reader_halt_card(nfc_reader);
		}

		// Heartbeat every 10 seconds
		if (heartbeat_counter++ % 100 == 0) {
			printf("💓 Heartbeat - Cards read: %lu, Heap: %lu bytes\n",
			       (unsigned long)card_count,
			       (unsigned long)esp_get_free_heap_size());
		}

		// Small delay
		vTaskDelay(pdMS_TO_TICKS(100));
	}
#else
	// Display-only mode - just keep running
	printf("Display test mode - system running\n");
	while (1) {
		vTaskDelay(pdMS_TO_TICKS(5000));
		printf("Display heartbeat...\n");
	}
#endif
}